-- liquibase formatted sql

-- changeset dasemenov:260317-1401-insert-mock-data-place-reviews-table
INSERT INTO reviews (id, profile_id, rate, comment, created_at) VALUES
('11111111-1111-1111-1111-111111111111', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 5, 'Отличное место!', NOW()),
('22222222-2222-2222-2222-222222222222', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 4.0, 'Уютно и вкусно', NOW()),
('33333333-3333-3333-3333-333333333333', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 3, 'Средненько', NOW()),
('44444444-4444-4444-4444-444444444444', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 5, NULL, NOW()),
('55555555-5555-5555-5555-555555555555', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 2.5, 'Не понравилось', NOW()),
('66666666-6666-6666-6666-666666666666', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 4, 'Хорошее обслуживание', NOW());

INSERT INTO reviews (id, profile_id, rate, comment, created_at) VALUES
('00000000-0000-0000-0000-000000000001', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 5, 'Отличное мероприятие!', NOW()),
('00000000-0000-0000-0000-000000000002', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 4.3, 'Хорошо, но можно лучше', NOW()),
('00000000-0000-0000-0000-000000000003', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 3, 'Нормально', NOW()),
('00000000-0000-0000-0000-000000000004', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 5, 'Супер!', NOW()),
('00000000-0000-0000-0000-000000000005', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 2.2, 'Не очень', NOW()),
('00000000-0000-0000-0000-000000000006', '5bc388a6-f95d-459d-b5b5-51b63e01c533', 4, NULL, NOW());
